count1 = 0
for i in range(1, 100000):
    a1 = i // 100000 #1-я цифра
    b1 = (i // 10000) % 10 #2-я цифра
    c1 = (i // 1000) % 10 #3-я цифра
    d1 = (i // 100) % 10 #4-я цифра
    e1 = (i // 10) % 10 #5-я цифра
    f1 = (i % 10) #6-я цифра
    if a1 + b1 + c1 == d1 + e1 + f1:
        count1 += 1

count2 = 0
for i in range(100000, 1000000):
    a2 = i // 100000 #1-я цифра
    b2 = (i // 10000) % 10 #2-я цифра
    c2 = (i // 1000) % 10 #3-я цифра
    d2 = (i // 100) % 10 #4-я цифра
    e2 = (i // 10) % 10 #5-я цифра
    f2 = (i % 10) #6-я цифра
    if a2 + b2 + c2 == d2 + e2 + f2:
        count2 += 1
print(f"Количество «счастливых» билетиков в одном рулоне = {count1 + count2}")
